pehill-5-cases-OpenFOAM/case_0p5/0/TauDNS
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      TauDNS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
14751
(
(9.099548774957596771e-07 1.269167819694948901e-08 0.000000000000000000e+00 1.279954901693538382e-09 0.000000000000000000e+00 3.109566117288462960e-07)
(9.114540445879164938e-07 1.285656918523542386e-08 0.000000000000000000e+00 1.308146019814737939e-09 0.000000000000000000e+00 3.148357657986628352e-07)
(9.128784293425432718e-07 1.300354053327523201e-08 0.000000000000000000e+00 1.338595098648084750e-09 0.000000000000000000e+00 3.188866532517786383e-07)
(9.144306327672985921e-07 1.317748387472758737e-08 0.000000000000000000e+00 1.374199676604999812e-09 0.000000000000000000e+00 3.228576822027311712e-07)
(9.155295980407445783e-07 1.333581363678816415e-08 0.000000000000000000e+00 1.410359606332010880e-09 0.000000000000000000e+00 3.262614199169962510e-07)
(9.161931955393311791e-07 1.346232403572283775e-08 0.000000000000000000e+00 1.443289825563724449e-09 0.000000000000000000e+00 3.293967090283525201e-07)
(9.166004743987721672e-07 1.355590607265516979e-08 0.000000000000000000e+00 1.471590716958342927e-09 0.000000000000000000e+00 3.324932979914841761e-07)
(9.170195812910435422e-07 1.364483632711279492e-08 0.000000000000000000e+00 1.498599099999859480e-09 0.000000000000000000e+00 3.358737440033091244e-07)
...
)
;

boundaryField
{
    bottomWall
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            zeroGradient;
    }
}