pehill-5-cases-OpenFOAM/case_0p5/0/UDNS
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UDNS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
14751
(
(1.764255678202529456e-03 2.535928402555273558e-07 2.095651409471246705e-06)
(1.755651592827901786e-03 3.409763497964463571e-07 2.044181160434029956e-06)
(1.745718394893004850e-03 3.680102513794082207e-07 2.016390885700110582e-06)
(1.734459385045946560e-03 3.687840036122968900e-07 1.991205137949407033e-06)
(1.721917818724688848e-03 4.546489720314735619e-07 1.948111614710277384e-06)
(1.708221520321697188e-03 5.238102396017734424e-07 1.925364171164396356e-06)
(1.693527673143481287e-03 5.047896794269720067e-07 1.898242645154844077e-06)
(1.677998625494159278e-03 5.245217690576176155e-07 1.860696107685495921e-06)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}