pehill-5-cases-OpenFOAM/case_0p5/0/V
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      V;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
14751
(
2.85709e-05
2.85695e-05
2.85648e-05
2.85628e-05
2.85637e-05
2.85638e-05
2.85634e-05
2.85636e-05
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.00714314
0.00748731
0.0099323
0.012887
0.0141028
0.0137794
0.0133372
0.0131172
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.00714242
0.00714242
0.00714242
0.00714242
0.00714242
0.00714242
0.00714242
0.00714242
...
)
;
    }
}


// ************************************************************************* //
